<?php
/**
 * 元数据
 *
 * 所谓元数据就是数据的数据。也就是说，元数据是描述数据的。
 * 就象数据表中的字段一样，每个字段描述了这个字段下的数据的含义。
 * 元数据可以用于创建文档，跟踪代码中的依赖性，甚至执行基本编译时检查。
 * 许多元数据工具，如XDoclet，将这些功能添加到核心Java语言中，暂时成为Java编程功能的一部分。
 * 一般来说，元数据的好处分为三类：文档编制、编译器检查和代码分析。
 * 代码级文档最常被引用。元数据提供了一种有用的方法来指明方法是否取决于其他方法，它们是否完整，特定类是否必须引用其他类，等等。
 */

/**
 * 注解
 *
 * Java中的注解就是Java源代码的元数据，也就是说注解是用来描述Java源代码的。  基本语法就是：@后面跟注解的名称。
 */

/**
 * Java中预定义注解
 *
 * ①Override：标识某一个方法是否正确覆盖了它的父类的方法。
 * ②Deprecated：表示已经不建议使用这个类成员了。  它是一个标记注解。
 * ③SuppressWarnings：用来抑制警告信息。
 */

